[
    {
        "Story": "Story Outline 1",
        "Event": "Event 1",
        "Description": "Agnes' family, despite being of Albanian descent, lived in Skopje, which was part of the then-Yugoslavia. Her father, Nikola, was a businessman and a progressive thinker who encouraged education for his children. The family was deeply religious and practiced charity, helping the poor and the needy.",
        "Learnings": "From this event, Teresa learned the importance of charity, education, and religious devotion.",
        "Actions": "As a child, Teresa participated in church activities and was influenced by her parents' charitable actions.",
        "Emotions": "Teresa likely felt a sense of love, security, and possibly a budding sense of duty towards the less fortunate."
    },
    {
        "Story": "Story Outline 2",
        "Event": "Event 1",
        "Description": "[The text is corrupted, but it seems to describe Teresa's early experiences with nature and animals, possibly indicating a peaceful and harmonious childhood.]",
        "Learnings": "[It is unclear from the corrupted text, but it might be inferred that Teresa learned about the harmony between humans and nature.]",
        "Actions": "[Teresa seems to have interacted peacefully with animals, indicating a nurturing and compassionate nature.]",
        "Emotions": "[The text does not provide clear emotional context, but one might assume feelings of joy and tranquility.]"
    },
    {
        "Story": "Story Outline 3",
        "Event": "Event 3",
        "Description": "Teresa takes on the role of a teacher in the Loreto Abbey, where she is responsible for educating students in geography, history, and other subjects, while also dealing with the emotional toll of witnessing poverty and suffering.",
        "Learnings": "She learns about the complexities of serving others, the impact of education on personal growth, and the emotional challenges of confronting poverty and inequity.",
        "Actions": "Teresa teaches and mentors her students, while also grappling with her own feelings of responsibility and desire to do more for the less fortunate.",
        "Emotions": "Teresa experiences a deep sense of compassion, a desire to help, and possibly guilt or frustration due to the limitations of her current role in addressing broader social issues."
    },
    {
        "Story": "Story Outline 4",
        "Event": "Event 4",
        "Description": "Teresa encounters a wounded young man during the aftermath of the riot, and she rushes to provide him with aid.",
        "Learnings": "She realizes the profound meaning of \"love wounds that bind,\" understanding the sacrifices involved in caring for others.",
        "Actions": "She administers first aid to the injured young man, showing immediate care and concern.",
        "Emotions": "Teresa feels a deep sorrow and empathy for the victim of violence, and she is emotionally affected by the incident."
    },
    {
        "Story": "Story Outline 6",
        "Event": "Event 1",
        "Description": "Teresa is called to serve the poor more directly, which involves leaving the comfort of her previous life and embracing a life among the destitute.",
        "Learnings": "She learns that true service requires not just love and compassion but also the courage to immerse oneself in the suffering of others.",
        "Actions": "Teresa decides to leave her previous life behind, responding to what she believes is a divine call to help the poor and the suffering.",
        "Emotions": "She experiences a mix of fear, determination, and a strong sense of duty and calling."
    },
    {
        "Story": "Story Outline 7",
        "Event": "Event 3",
        "Description": "Teresa insists on living a life of simplicity, eating rice and salt like the poor, to understand and share their experiences.",
        "Learnings": "She learns empathy and the power of solidarity with those she serves, understanding their struggles on a deeper level.",
        "Actions": "She chooses to live and eat as the poor do, despite having access to better provisions.",
        "Emotions": "She may feel a sense of unity and humility, as well as a possible internal conflict between her mission and the practicalities of her choices."
    },
    {
        "Story": "Story Outline 7",
        "Event": "Event 5",
        "Description": "A poor man shares his meager earnings with Teresa, showing his willingness to give despite his own poverty.",
        "Learnings": "She learns about the generosity of the poor and the value of giving without expecting anything in return.",
        "Actions": "She accepts the man's offering, recognizing the significance of his gesture.",
        "Emotions": "She feels gratitude and a deepened understanding of the selflessness of the poor."
    },
    {
        "Story": "Story Outline 8",
        "Event": "Event 2",
        "Description": "Teresa faces resistance and misunderstanding from the local community, who question her motives and accuse her of trying to convert the children to Christianity.",
        "Learnings": "Teresa learns about the importance of trust and the challenges of cultural differences. She also learns the value of patience and persistence in her mission.",
        "Actions": "She defends her intentions, tries to explain her mission of service, and continues her work despite the opposition.",
        "Emotions": "Teresa likely feels a range of emotions, including disappointment, sadness, and possibly anger at the misunderstanding, but also a strong sense of purpose and commitment."
    },
    {
        "Story": "Story Outline 9",
        "Event": "Event 1",
        "Description": "Mother Teresa witnesses a dying man under a tree and is struck by the realization that many people die alone and in need of care. This motivates her to start a hospice for the dying in Calcutta.",
        "Learnings": "She learns about the importance of human touch and compassion in the final moments of life.",
        "Actions": "She rents a simple building with the help of donations and begins her hospice for the dying.",
        "Emotions": "She feels a deep sense of compassion and determination to alleviate the suffering of the dying."
    },
    {
        "Story": "Story Outline 10",
        "Event": "Event 1",
        "Description": "Mother Teresa and her colleagues, referred to as \"G\" and \"yy,\" are depicted in a contemplative moment, discussing the significance of a simple pencil, symbolizing their humble service.",
        "Learnings": "From this event, Mother Teresa learns about the value of humility and the power of simple acts in serving others, as she identifies herself with a pencil, a tool used for writing and drawing.",
        "Actions": "She engages in a conversation that reflects her self-perception as a simple tool in the hands of God.",
        "Emotions": "The text does not provide explicit emotional cues, but it can be inferred that she feels a sense of humility and purpose."
    },
    {
        "Story": "Story Outline 10",
        "Event": "Event 6",
        "Description": "The narrative describes Mother Teresa's outreach to the poor, the suffering, and the neglected, emphasizing the spiritual aspect of their service.",
        "Learnings": "She learns about the universal need for love and compassion, which transcends material poverty.",
        "Actions": "Mother Teresa and her followers actively seek out those in need, providing care and spiritual comfort.",
        "Emotions": "The text suggests a deep sense of empathy and a strong commitment to their mission."
    },
    {
        "Story": "Story Outline 11",
        "Event": "Event 2",
        "Description": "As the number of abandoned children increased, Mother Teresa decided to establish a formal orphanage, which also served as a temporary maternity home for poor women.",
        "Learnings": "She learned about the resilience of life, even in the face of attempts to end it, and the profound responsibility to protect and nurture life.",
        "Actions": "She took the initiative to create a safe space for infants and children, providing them with care, love, and a chance at life.",
        "Emotions": "Mother Teresa likely felt a strong sense of purpose, love, and possibly frustration at the societal conditions that led to such遗弃."
    },
    {
        "Story": "Story Outline 12",
        "Event": "Event 2",
        "Description": "The establishment of a leprosy home against societal resistance, where Teresa and her helpers provide care and a sense of belonging to the patients.",
        "Learnings": "The importance of community and acceptance in the healing process for those suffering from leprosy.",
        "Actions": "She persists in her mission to care for leprosy patients, despite opposition, and works to change societal attitudes towards them.",
        "Emotions": "Resilience in the face of adversity, empathy for the suffering, and a strong commitment to her mission."
    },
    {
        "Story": "Story Outline 13",
        "Event": "Event 1",
        "Description": "The formation of the Missionaries of Charity Brothers, the male branch of the Missionaries of Charity, and their commitment to serve the poor and the sick.",
        "Learnings": "The importance of including men in the mission to serve the poor and the significance of unity in the mission's work.",
        "Actions": "Officially establishing the Missionaries of Charity Brothers and overseeing their work.",
        "Emotions": "A sense of fulfillment and joy in expanding the mission's reach."
    },
    {
        "Story": "Story Outline 14",
        "Event": "Event 1",
        "Description": "In 1980, Mother Teresa initiated the expansion of the Missionaries of Charity to various countries, including Russia, Kenya, and others, where they established medical centers, dispensaries, and served the poor and needy.",
        "Learnings": "She learned about the universal need for compassion and the importance of serving the poor regardless of political or geographical boundaries.",
        "Actions": "She established charitable institutions, provided nutritious food, and worked towards alleviating poverty and suffering.",
        "Emotions": "Despite facing opposition, she remained steadfast, showing determination, compassion, and a sense of duty towards the less fortunate."
    },
    {
        "Story": "Story Outline 14",
        "Event": "Event 3",
        "Description": "Mother Teresa's visit to a poor area, where she encountered an elderly person who had not experienced warmth or care for a long time.",
        "Learnings": "She learned about the profound impact of simple acts of kindness and the deep-seated need for human connection and compassion.",
        "Actions": "She provided comfort and companionship to the elderly person, sitting with them and offering a listening ear.",
        "Emotions": "She felt empathy and a strong desire to alleviate the loneliness and suffering of the elderly."
    },
    {
        "Story": "Story Outline 15",
        "Event": "Event 1",
        "Description": "Mother Teresa's initial work in helping the poor and the suffering, and the establishment of the Missionaries of Charity.",
        "Learnings": "The importance of direct service to the poor and the power of love and compassion in alleviating suffering.",
        "Actions": "She began her mission by helping the poor in the slums, providing care for the sick and the dying, and eventually founded the Missionaries of Charity.",
        "Emotions": "A sense of calling, determination, and love for the people she served, despite the hardships."
    },
    {
        "Story": "Story Outline 18",
        "Event": "Event 2",
        "Description": "Upon learning about the cost of the banquet associated with the Nobel Prize ceremony, Mother Teresa requested that it be canceled and the funds be donated to the poor in Calcutta.",
        "Learnings": "This event may have underscored the importance of putting her values into action, even in the face of tradition and expectation.",
        "Actions": "She made a direct request to the Nobel committee to cancel the banquet and redirect the funds to those in need.",
        "Emotions": "There might have been a mix of determination and possibly concern about how her request would be received."
    }
]