[
    {
        "Story": "Story Outline 4",
        "Event": "Event 1",
        "Description": "Teresa witnesses the stark contrast between the world within the walls of opulence and the world outside filled with poverty and suffering. She is moved by the disparity and decides to serve the poor.",
        "Learnings": "She learns about the deep divide in society and the importance of compassion and service to those less fortunate.",
        "Actions": "Teresa takes the initiative to provide food, clothing, and medical aid to the poor, and offers them comfort through conversation.",
        "Emotions": "She experiences a mix of emotions, including empathy, sadness for the poor, and a sense of fulfillment from helping them."
    },
    {
        "Story": "Story Outline 5",
        "Event": "Event 1",
        "Description": "Teresa is traveling by train on September 10, 1946, and during her journey, she reads the Bible, specifically the Parable of the Sheep and the Goats. She experiences a deep spiritual connection and feels a call to serve the poor and the suffering.",
        "Learnings": "From the event, Teresa learns about the importance of recognizing Christ in the poor and the needy. She is deeply moved by the realization that serving the less fortunate is akin to serving Christ Himself.",
        "Actions": "During the event, Teresa gives a coin to a begging old man on the train platform, which is snatched away by a man before the old man can pick it up.",
        "Emotions": "Teresa feels a deep sense of empathy and compassion for the poor and suffering. She is also filled with a sense of duty and a calling to serve them."
    },
    {
        "Story": "Story Outline 6",
        "Event": "Event 2",
        "Description": "Teresa encounters a dying old woman on the streets, who is neglected and in desperate need of help.",
        "Learnings": "She learns about the harsh reality of poverty and the indifference of society towards the suffering of the poor.",
        "Actions": "Teresa tries to get the woman medical help but faces the harsh reality of inadequate facilities and the inability to secure immediate assistance.",
        "Emotions": "She feels a deep sense of frustration, sadness, and helplessness, but also a renewed commitment to her mission."
    },
    {
        "Story": "Story Outline 7",
        "Event": "Event 4",
        "Description": "Teresa encounters a severely ill person on the street and takes care of them, providing comfort and showing compassion.",
        "Learnings": "She learns the profound impact of human touch and compassion, even in the face of death.",
        "Actions": "She physically assists the sick person, cleans them, and provides emotional support.",
        "Emotions": "She experiences empathy, sorrow, and a deep sense of purpose."
    },
    {
        "Story": "Story Outline 8",
        "Event": "Event 1",
        "Description": "Teresa returns to the impoverished city after a period of absence, with the intention to serve its residents. She faces the harsh reality of the living conditions, including the lack of clean water and proper shelter.",
        "Learnings": "From this event, Teresa learns about the depth of poverty and the resilience of the people living in it. She also realizes the importance of her mission and the challenges she must overcome.",
        "Actions": "Teresa actively seeks a place to stay and work, engages with the local people, and begins her mission of service by offering education and care to the children of the slums.",
        "Emotions": "Teresa experiences a mix of emotions, including determination, empathy for the poor, and possibly frustration at the difficult conditions she encounters."
    },
    {
        "Story": "Story Outline 10",
        "Event": "Event 4",
        "Description": "The narrative discusses the simplicity and poverty of Mother Teresa and her followers, their possessions, and their daily life.",
        "Learnings": "She learns about the essence of true poverty and the spiritual richness that comes from living a life dedicated to service.",
        "Actions": "Mother Teresa and her followers live a life of voluntary poverty, choosing to own only the bare essentials.",
        "Emotions": "The text suggests a sense of contentment and spiritual joy despite the material poverty."
    },
    {
        "Story": "Story Outline 11",
        "Event": "Event 1",
        "Description": "Mother Teresa and her followers began their mission by searching for those abandoned on the streets, bringing them back to their care center, where they provided shelter and care.",
        "Learnings": "From this event, Mother Teresa learned the extent of human suffering and the importance of unconditional love and care for the destitute.",
        "Actions": "She initiated the rescue of abandoned individuals, including a paralyzed middle-aged woman found on the street, and expanded their mission to include caring for the sick and the dying.",
        "Emotions": "Mother Teresa likely experienced a mix of compassion, determination, and perhaps sadness at the plight of those she helped."
    },
    {
        "Story": "Story Outline 12",
        "Event": "Event 1",
        "Description": "Mother Teresa's initial efforts to help the leprosy patients who were ostracized and left to die. She opens a soup kitchen for the homeless and plans to establish a home for leprosy patients.",
        "Learnings": "She learns about the depth of human suffering and the urgent need for compassion and care for those afflicted with leprosy.",
        "Actions": "She sets up a soup kitchen, plans to create a home for leprosy patients, and buys a vehicle to serve as a mobile clinic.",
        "Emotions": "Compassion, determination, and a sense of duty to serve the less fortunate."
    },
    {
        "Story": "Story Outline 13",
        "Event": "Event 2",
        "Description": "Mother Teresa's visit to a prison and her profound emotional response to the suffering she witnessed there.",
        "Learnings": "A deeper understanding of the pain and suffering of the imprisoned, reinforcing her commitment to serve all in need.",
        "Actions": "Visiting the prison, interacting with the inmates, and reflecting on the experience in silence.",
        "Emotions": "Deep sorrow and a sense of shock at the conditions and treatment of the prisoners."
    },
    {
        "Story": "Story Outline 13",
        "Event": "Event 5",
        "Description": "Mother Teresa's initiative to collect leftover food from airplanes to feed the poor.",
        "Learnings": "The potential to transform waste into a valuable resource for those in need.",
        "Actions": "Negotiating with airport staff and implementing a system to distribute leftover food to the poor.",
        "Emotions": "Innovation and determination in addressing hunger among the poor."
    },
    {
        "Story": "Story Outline 16",
        "Event": "Event 2",
        "Description": "A young admirer of Mother Teresa travels a great distance to meet her, only to find her engaged in humble tasks such as washing clothes, demonstrating her commitment to service regardless of her fame.",
        "Learnings": "This event likely reinforced Mother Teresa's belief in the value of manual labor and the dignity of all work, regardless of one's status or recognition.",
        "Actions": "Mother Teresa was found performing mundane tasks, showing that she did not let her status exempt her from the day-to-day work required by her mission.",
        "Emotions": "The text does not provide explicit information about her emotions during this event, but it can be assumed that she was at peace with her actions and content with her lifestyle."
    },
    {
        "Story": "Story Outline 17",
        "Event": "Event 1",
        "Description": "Mother Teresa encounters an old, hungry man by the roadside and takes him in, emphasizing that neglecting one hungry person adds to the world's hunger.",
        "Learnings": "She learns the importance of direct action and service to alleviate suffering, reinforcing her belief in the \"fruits of love\" being through service.",
        "Actions": "She brings the old man back to her place, showing care and concern for his immediate needs.",
        "Emotions": "Compassion and a sense of duty to serve are evident in her response to the man's plight."
    },
    {
        "Story": "Story Outline 17",
        "Event": "Event 5",
        "Description": "Mother Teresa faces a severe drought in Ethiopia and mobilizes aid, including food, medicine, and personnel, to alleviate the suffering.",
        "Learnings": "She learns about the global scale of humanitarian crises and the need for immediate and coordinated relief efforts.",
        "Actions": "She organizes and sends aid to Ethiopia, including a team to provide direct assistance.",
        "Emotions": "Urgency and deep concern for the victims of the drought."
    }
]