[
    {
        "Story": "Story Outline 1",
        "Event": "Event 2",
        "Description": "The death of Teresa's father, Nikola, when she was only eight years old, left the family in a difficult situation. Her mother, Drane, took over the family business and managed to keep the family afloat despite the loss.",
        "Learnings": "Teresa learned resilience and the strength of women from her mother's determination to support the family.",
        "Actions": "Teresa likely helped her mother and contributed to the family's efforts to overcome their hardship.",
        "Emotions": "Teresa would have experienced grief, confusion, and possibly a sense of responsibility."
    },
    {
        "Story": "Story Outline 2",
        "Event": "Event 2",
        "Description": "[The text describes Teresa's exposure to missionary work and the conditions of poverty and hardship in distant lands, which deeply affected her.]",
        "Learnings": "[Teresa learned about the harsh realities of poverty and the need for humanitarian aid.]",
        "Actions": "[Teresa began to contemplate her role in addressing these issues and showed a keen interest in missionary work.]",
        "Emotions": "[Shock, empathy, and a growing sense of responsibility and desire to help.]"
    },
    {
        "Story": "Story Outline 4",
        "Event": "Event 2",
        "Description": "During a time of famine, Teresa, now a leader, faces the challenge of providing for the needs of the people, including her own community, which is also affected by the scarcity of food.",
        "Learnings": "She learns about the importance of resilience and the need to prioritize the well-being of her community during a crisis.",
        "Actions": "Teresa takes on the responsibility of ensuring food supply for her community and the poor, even amidst the chaos of a riot.",
        "Emotions": "She feels overwhelmed by the situation, showing concern, determination, and a sense of duty."
    },
    {
        "Story": "Story Outline 4",
        "Event": "Event 3",
        "Description": "Teresa and her companion face a dangerous situation as they try to transport food through a rioting crowd, with the help of British soldiers.",
        "Learnings": "She learns about the harsh realities of violence and the desperation of people in extreme need.",
        "Actions": "Teresa bravely navigates through the crowd, with the assistance of the soldiers, to deliver the food.",
        "Emotions": "She experiences fear, shock, and a deep sense of compassion for the suffering people."
    },
    {
        "Story": "Story Outline 5",
        "Event": "Event 2",
        "Description": "Teresa's train journey continues, and she observes the stark contrast between the first-class and third-class compartments. She is moved by the sight of the poor trying to board the train and finds herself drawn to their plight.",
        "Learnings": "This event teaches Teresa about the stark inequalities in society and the desperate conditions of the poor. It reinforces her commitment to serve them and to understand their struggles.",
        "Actions": "Teresa steps into the third-class compartment, overwhelmed by the sight of the poor and reflects on the universal brotherhood of humanity.",
        "Emotions": "She experiences a mix of emotions, including sadness, empathy, and a strong desire to help. The sight of the poor triggers a deep introspection about her purpose and role in society."
    },
    {
        "Story": "Story Outline 6",
        "Event": "Event 3",
        "Description": "Despite the lack of support and resources, Teresa takes the old woman in her arms during a rainstorm, providing comfort and care.",
        "Learnings": "She learns the importance of direct action and personal involvement in alleviating suffering, regardless of the circumstances.",
        "Actions": "Teresa physically takes the old woman in her arms, shielding her from the rain and providing comfort.",
        "Emotions": "She feels compassion, love, and a strong desire to alleviate the suffering of the woman, even in the face of her own limitations."
    },
    {
        "Story": "Story Outline 7",
        "Event": "Event 2",
        "Description": "Teresa learns medical and nursing skills in a short period, despite the standard requirement being two years, showing her dedication and the urgency of her mission.",
        "Learnings": "She learns about the practical aspects of caring for the sick and the importance of adapting and overcoming obstacles to achieve her goals.",
        "Actions": "She creates her own accelerated learning method to acquire the necessary medical knowledge in half the time.",
        "Emotions": "She likely feels a sense of urgency, commitment, and accomplishment."
    },
    {
        "Story": "Story Outline 8",
        "Event": "Event 3",
        "Description": "Teresa's health deteriorates due to the harsh conditions and her relentless work, leading to her collapse.",
        "Learnings": "This event teaches Teresa about the importance of self-care and the balance between serving others and maintaining her own well-being.",
        "Actions": "Teresa initially resists resting, insisting on continuing her work, but eventually succumbs to the need for rest and recovery.",
        "Emotions": "Teresa experiences guilt for not being able to continue serving, sadness at her physical limitations, and possibly a sense of failure for not being able to meet the needs of the community."
    },
    {
        "Story": "Story Outline 10",
        "Event": "Event 3",
        "Description": "The story mentions the growth of the Missionaries of Charity and the challenges of accommodating the increasing number of members, leading to the acquisition of a new building.",
        "Learnings": "Mother Teresa learns about the practical aspects of managing an organization and the importance of infrastructure in supporting her mission.",
        "Actions": "She actively seeks and accepts donations to expand the facilities for her order.",
        "Emotions": "The text does not provide explicit emotional cues, but it can be inferred that she feels gratitude and determination."
    },
    {
        "Story": "Story Outline 11",
        "Event": "Event 5",
        "Description": "Mother Teresa's mission faced logistical challenges, such as the need for more space and resources to accommodate the growing number of children and the poor seeking help.",
        "Learnings": "She learned about the complexities of managing an expanding organization and the importance of strategic planning and resource management.",
        "Actions": "She sought international support and established a network of donors and volunteers to sustain and grow her mission.",
        "Emotions": "Mother Teresa may have experienced a range of emotions, from concern over the challenges to gratitude for the support received."
    },
    {
        "Story": "Story Outline 14",
        "Event": "Event 2",
        "Description": "In 1985, Mother Teresa faced resistance in Russia when she attempted to open a charity house but was met with the Prime Minister's refusal, citing the ongoing revolution and the government's intent to solve such issues.",
        "Learnings": "She learned about the complexities of political ideologies and the challenges of implementing charitable work in politically sensitive environments.",
        "Actions": "She responded calmly, emphasizing that her revolution included love, and continued her mission despite the opposition.",
        "Emotions": "She showed patience, resilience, and a deep sense of purpose."
    },
    {
        "Story": "Story Outline 15",
        "Event": "Event 3",
        "Description": "Mother Teresa's experience in East Pakistan (now Bangladesh) during the 1971 war and the subsequent establishment of the Missionaries of Charity there.",
        "Learnings": "The universality of human suffering and the importance of immediate action in crisis situations.",
        "Actions": "She provided aid to refugees, cared for the wounded, and established the Missionaries of Charity to continue the work after the crisis.",
        "Emotions": "Compassion for the victims of war, a sense of urgency, and perhaps sadness at the extent of human suffering."
    },
    {
        "Story": "Story Outline 17",
        "Event": "Event 3",
        "Description": "During a visit to a prison, Mother Teresa is deeply affected by the living conditions of the inmates and requests improvements in their care.",
        "Learnings": "She learns about the injustices within the prison system and the need for basic human rights and dignity even for the incarcerated.",
        "Actions": "She lobbies for better living conditions and care for the prisoners, eventually establishing a facility for the mentally ill and physically disabled.",
        "Emotions": "Empathy and sorrow for the prisoners' suffering, coupled with a strong resolve to improve their conditions."
    }
]